#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.6`
* Working Directory 📂`./tests/e2e`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.automation_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.consumption_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.governance_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.container_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg][0m
[0m[1mmodule.data_management_zone.azurerm_resource_group.unity_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg][0m
[0m[1mmodule.data_management_zone.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_management_zone.data.azurerm_route_table.route_table: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dmgmt-rt001][0m
[0m[1mmodule.data_management_zone.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001][0m
[0m[1mmodule.data_management_zone.data.azurerm_network_security_group.network_security_group: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dmgmt-nsg001][0m
[0m[1mmodule.data_management_zone.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001][0m
[0m[1mmodule.data_management_zone.azurerm_user_assigned_identity.user_assigned_identity: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-automation-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mydmgmt-dev-uai001][0m
[0m[1mmodule.data_management_zone.azurerm_container_registry.container_registry: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.ContainerRegistry/registries/mydmgmtdevacr001][0m
[0m[1mmodule.data_management_zone.azurerm_databricks_access_connector.databricks_access_connector: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Databricks/accessConnectors/mydmgmt-dev-dbac001][0m
[0m[1mmodule.data_management_zone.azurerm_synapse_private_link_hub.synapse_pl_hub: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Synapse/privateLinkHubs/mydmgmtdevsynplh001][0m
[0m[1mmodule.data_management_zone.data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001][0m
[0m[1mmodule.data_management_zone.azapi_resource.private_endpoint_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-kv001-pe][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.container_registry_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-container-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevacr001-pe][0m
[0m[1mmodule.data_management_zone.azapi_resource.databricks_private_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPrivateSubnet][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.synapse_pl_hub_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevsynplh001-pe][0m
[0m[1mmodule.data_management_zone.azapi_resource.databricks_public_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/DatabricksPublicSubnet][0m
[0m[1mmodule.data_management_zone.azurerm_role_assignment.databricks_access_connector_roleassignment_datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/providers/Microsoft.Authorization/roleAssignments/76058420-a1f8-e022-27c9-2f7fc927f0b2][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-blob-pe][0m
[0m[1mmodule.data_management_zone.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/managementPolicies/default][0m
[0m[1mmodule.data_management_zone.azurerm_role_assignment.current_roleassignment_storage: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001/providers/Microsoft.Authorization/roleAssignments/6930346d-69b0-dd0e-91fa-dde5d95d5978][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Network/privateEndpoints/mydmgmtdevst001-dfs-pe][0m
[0m[1mmodule.data_management_zone.azurerm_storage_container.datalake_container_unity: Refreshing state... [id=https://mydmgmtdevst001.blob.core.windows.net/unitynortheurope][0m
[0m[1mmodule.data_management_zone.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Databricks/workspaces/mydmgmt-dev-cnsmptn-dbw001][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-uiapi-pe][0m
[0m[1mmodule.data_management_zone.azurerm_private_endpoint.databricks_private_endpoint_web: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-consumption-rg/providers/Microsoft.Network/privateEndpoints/mydmgmt-dev-cnsmptn-dbw001-web-pe][0m
[0m[1mmodule.data_management_zone.databricks_metastore.metastore: Refreshing state... [id=92138325-3c80-4447-bd29-3bac8e87193e][0m
[0m[1mmodule.data_management_zone.databricks_metastore_assignment.metastore_assignment: Refreshing state... [id=7650325733143212|92138325-3c80-4447-bd29-3bac8e87193e][0m
[0m[1mmodule.data_management_zone.databricks_metastore_data_access.metastore_data_access: Refreshing state... [id=92138325-3c80-4447-bd29-3bac8e87193e|ec6bd72e-8873-478f-ab03-77c388235d2e][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # module.data_management_zone.data.azapi_resource.purview[0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "azapi_resource" "purview" {
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m location               = (known after apply)
      [32m+[0m[0m output                 = (known after apply)
      [32m+[0m[0m resource_id            = (known after apply)
      [32m+[0m[0m response_export_values = [
          [32m+[0m[0m "properties.managedResources.storageAccount",
          [32m+[0m[0m "properties.managedResources.eventHubNamespace",
        ]
      [32m+[0m[0m tags                   = (known after apply)
      [32m+[0m[0m type                   = "Microsoft.Purview/accounts@2021-07-01"
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_account[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_account" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-account-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-account-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-account-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.purview.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-account-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "account",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_blob[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_blob" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-blob-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-pe-blob"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-blob-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-blob-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "blob",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_namespace[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_namespace" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-namespace-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-pe-namespace"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-namespace-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-namespace-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "namespace",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_portal[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_portal" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-portal-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-portal-pe"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-portal-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.purviewstudio.azure.com",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-portal-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "portal",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_private_endpoint.purview_private_endpoint_queue[0m will be created
[0m  [32m+[0m[0m resource "azurerm_private_endpoint" "purview_private_endpoint_queue" {
      [32m+[0m[0m custom_dns_configs            = (known after apply)
      [32m+[0m[0m custom_network_interface_name = "mydmgmt-dev-pview001-queue-nic"
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m location                      = "northeurope"
      [32m+[0m[0m name                          = "mydmgmt-dev-pview001-pe-queue"
      [32m+[0m[0m network_interface             = (known after apply)
      [32m+[0m[0m private_dns_zone_configs      = (known after apply)
      [32m+[0m[0m resource_group_name           = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m subnet_id                     = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dmgmt-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dmgmt-vnet001/subnets/ServicesSubnet"

      [32m+[0m[0m private_dns_zone_group {
          [32m+[0m[0m id                   = (known after apply)
          [32m+[0m[0m name                 = "mydmgmt-dev-pview001-queue-arecord"
          [32m+[0m[0m private_dns_zone_ids = [
              [32m+[0m[0m "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-global-dns/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net",
            ]
        }

      [32m+[0m[0m private_service_connection {
          [32m+[0m[0m is_manual_connection           = false
          [32m+[0m[0m name                           = "mydmgmt-dev-pview001-queue-pe"
          [32m+[0m[0m private_connection_resource_id = (known after apply)
          [32m+[0m[0m private_ip_address             = (known after apply)
          [32m+[0m[0m subresource_names              = [
              [32m+[0m[0m "queue",
            ]
        }
    }

[1m  # module.data_management_zone.azurerm_purview_account.purview[0m will be created
[0m  [32m+[0m[0m resource "azurerm_purview_account" "purview" {
      [32m+[0m[0m atlas_kafka_endpoint_primary_connection_string   = (sensitive value)
      [32m+[0m[0m atlas_kafka_endpoint_secondary_connection_string = (sensitive value)
      [32m+[0m[0m catalog_endpoint                                 = (known after apply)
      [32m+[0m[0m guardian_endpoint                                = (known after apply)
      [32m+[0m[0m id                                               = (known after apply)
      [32m+[0m[0m location                                         = "southcentralus"
      [32m+[0m[0m managed_resource_group_name                      = "mydmgmt-dev-pview001-rg"
      [32m+[0m[0m managed_resources                                = (known after apply)
      [32m+[0m[0m name                                             = "mydmgmt-dev-pview001"
      [32m+[0m[0m public_network_enabled                           = false
      [32m+[0m[0m resource_group_name                              = "mydmgmt-dev-governance-rg"
      [32m+[0m[0m scan_endpoint                                    = (known after apply)

      [32m+[0m[0m identity {
          [32m+[0m[0m principal_id = (known after apply)
          [32m+[0m[0m tenant_id    = (known after apply)
          [32m+[0m[0m type         = "SystemAssigned"
        }
    }

[1m  # module.data_management_zone.azurerm_role_assignment.purview_roleassignment_key_vault[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "purview_roleassignment_key_vault" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = (known after apply)
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Key Vault Secrets User"
      [32m+[0m[0m scope                            = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-governance-rg/providers/Microsoft.KeyVault/vaults/mydmgmt-dev-kv001"
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_role_assignment.user_assigned_identity_roleassignment_governance_rg[0m will be created
[0m  [32m+[0m[0m resource "azurerm_role_assignment" "user_assigned_identity_roleassignment_governance_rg" {
      [32m+[0m[0m id                               = (known after apply)
      [32m+[0m[0m name                             = (known after apply)
      [32m+[0m[0m principal_id                     = "7ef98b1a-f181-4fad-98c0-bf26696fd5f0"
      [32m+[0m[0m principal_type                   = (known after apply)
      [32m+[0m[0m role_definition_id               = (known after apply)
      [32m+[0m[0m role_definition_name             = "Owner"
      [32m+[0m[0m scope                            = (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
    }

[1m  # module.data_management_zone.azurerm_storage_account.datalake[0m will be updated in-place
[0m  [33m~[0m[0m resource "azurerm_storage_account" "datalake" {
        id                                = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydmgmt-dev-unity-rg/providers/Microsoft.Storage/storageAccounts/mydmgmtdevst001"
        name                              = "mydmgmtdevst001"
        tags                              = {}
        [90m# (39 unchanged attributes hidden)[0m[0m

      [33m~[0m[0m network_rules {
            [90m# (4 unchanged attributes hidden)[0m[0m

          [31m-[0m[0m private_link_access {
              [31m-[0m[0m endpoint_resource_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Security/datascanners/storageDataScanner" [90m-> null[0m[0m
              [31m-[0m[0m endpoint_tenant_id   = "3556be79-2979-4b19-a1af-4dd4e6d9ed7e" [90m-> null[0m[0m
            }

            [90m# (2 unchanged blocks hidden)[0m[0m
        }

        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1mPlan:[0m 8 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>